In [42]:
import psycopg2 as pg2
import pandas as pd
import re
conn = pg2.connect(database='dvd_rentals', user='victor', password='}H9D^E*PUHTTuB&"')
cur = conn.cursor()

In [43]:
cur.execute("SELECT * FROM film")
filmdata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film' ORDER BY ORDINAL_POSITION")
filmcolumns = list()
for i in cur.fetchall():
    filmcolumns.append(i[0])
filmdf = pd.DataFrame(data=filmdata, columns=filmcolumns)
filmdf = filmdf.drop(columns='last_update')
filmdf
#df from film table

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,[Behind the Scenes],'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,[Trailers],'airport':1 'ancient':18 'confront':14 'epic':...
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,[Trailers],'boat':20 'bright':1 'conquer':14 'encount':2 ...
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"[Deleted Scenes, Behind the Scenes]",'academi':1 'battl':15 'canadian':20 'dinosaur...
5,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"[Trailers, Deleted Scenes]",'ace':1 'administr':9 'ancient':19 'astound':4...
6,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"[Trailers, Deleted Scenes]",'adapt':1 'astound':4 'baloon':19 'car':11 'fa...
7,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"[Commentaries, Behind the Scenes]",'affair':1 'chase':14 'documentari':5 'fanci':...
8,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,[Deleted Scenes],'african':1 'chef':11 'dentist':14 'documentar...
9,6,Agent Truman,A Intrepid Panorama of a Robot And a Boy who m...,2006,1,3,2.99,169,17.99,PG,[Deleted Scenes],'agent':1 'ancient':19 'boy':11 'china':20 'es...

In [44]:
cur.execute("SELECT * FROM actor")
actordata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'actor' ORDER BY ORDINAL_POSITION")
actorcolumns = list()
for i in cur.fetchall():
    actorcolumns.append(i[0])
actordf = pd.DataFrame(data=actordata, columns=actorcolumns)
actordf
#df from actor table

   actor_id first_name     last_name             last_update
0         1   Penelope       Guiness 2013-05-26 14:47:57.620
1         2       Nick      Wahlberg 2013-05-26 14:47:57.620
2         3         Ed         Chase 2013-05-26 14:47:57.620
3         4   Jennifer         Davis 2013-05-26 14:47:57.620
4         5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
5         6      Bette     Nicholson 2013-05-26 14:47:57.620
6         7      Grace        Mostel 2013-05-26 14:47:57.620
7         8    Matthew     Johansson 2013-05-26 14:47:57.620
8         9        Joe         Swank 2013-05-26 14:47:57.620
9        10  Christian         Gable 2013-05-26 14:47:57.620

In [45]:
cur.execute("SELECT * FROM film_actor")
film_actordata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_actor' ORDER BY ORDINAL_POSITION")
film_actorcolumns = list()
for i in cur.fetchall():
    film_actorcolumns.append(i[0])
film_actordf = pd.DataFrame(data=film_actordata, columns=film_actorcolumns)
film_actordf
#df from film_actor table

   actor_id  film_id         last_update
0         1        1 2006-02-15 10:05:03
1         1       23 2006-02-15 10:05:03
2         1       25 2006-02-15 10:05:03
3         1      106 2006-02-15 10:05:03
4         1      140 2006-02-15 10:05:03
5         1      166 2006-02-15 10:05:03
6         1      277 2006-02-15 10:05:03
7         1      361 2006-02-15 10:05:03
8         1      438 2006-02-15 10:05:03
9         1      499 2006-02-15 10:05:03

In [46]:
cur.execute("SELECT * FROM rental")
rentaldata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'rental' ORDER BY ORDINAL_POSITION")
rentalcolumns = list()
for i in cur.fetchall():
    rentalcolumns.append(i[0])
rentaldf = pd.DataFrame(data=rentaldata, columns=rentalcolumns)
rentaldf
#df from rental table

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-16 02:30:53
5,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-16 02:30:53
6,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-16 02:30:53
7,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-16 02:30:53
8,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-16 02:30:53
9,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2,2006-02-16 02:30:53

In [47]:
cur.execute("SELECT * FROM payment")
paymentdata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'payment' ORDER BY ORDINAL_POSITION")
paymentcolumns = list()
for i in cur.fetchall():
    paymentcolumns.append(i[0])
paymentdf = pd.DataFrame(data=paymentdata, columns=paymentcolumns)
paymentdf
#df from payment table

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996577
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996577
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996577
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996577
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996577
5,17508,341,1,3382,5.99,2007-02-21 12:33:49.996577
6,17509,342,2,2190,5.99,2007-02-17 23:58:17.996577
7,17510,342,1,2914,5.99,2007-02-20 02:11:44.996577
8,17511,342,1,3081,2.99,2007-02-20 13:57:39.996577
9,17512,343,2,1547,4.99,2007-02-16 00:10:50.996577

In [48]:
cur.execute("SELECT * FROM inventory")
inventorydata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'inventory' ORDER BY ORDINAL_POSITION")
inventorycolumns = list()
for i in cur.fetchall():
    inventorycolumns.append(i[0])
inventorydf = pd.DataFrame(data=inventorydata, columns=inventorycolumns)
inventorydf
#df from inventory table

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 10:09:17
1             2        1         1 2006-02-15 10:09:17
2             3        1         1 2006-02-15 10:09:17
3             4        1         1 2006-02-15 10:09:17
4             5        1         2 2006-02-15 10:09:17
5             6        1         2 2006-02-15 10:09:17
6             7        1         2 2006-02-15 10:09:17
7             8        1         2 2006-02-15 10:09:17
8             9        2         2 2006-02-15 10:09:17
9            10        2         2 2006-02-15 10:09:17

In [49]:
cur.execute("SELECT * FROM film_category")
film_categorydata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_category' ORDER BY ORDINAL_POSITION")
film_categorycolumns = list()
for i in cur.fetchall():
    film_categorycolumns.append(i[0])
film_categorydf = pd.DataFrame(data=film_categorydata, columns=film_categorycolumns)
film_categorydf
#df from film_category table

   film_id  category_id         last_update
0        1            6 2006-02-15 10:07:09
1        2           11 2006-02-15 10:07:09
2        3            6 2006-02-15 10:07:09
3        4           11 2006-02-15 10:07:09
4        5            8 2006-02-15 10:07:09
5        6            9 2006-02-15 10:07:09
6        7            5 2006-02-15 10:07:09
7        8           11 2006-02-15 10:07:09
8        9           11 2006-02-15 10:07:09
9       10           15 2006-02-15 10:07:09

In [50]:
cur.execute("SELECT * FROM category")
categorydata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'category' ORDER BY ORDINAL_POSITION")
categorycolumns = list()
for i in cur.fetchall():
    categorycolumns.append(i[0])
categorydf = pd.DataFrame(data=categorydata, columns=categorycolumns)
categorydf
#df from category table

   category_id         name         last_update
0            1       Action 2006-02-15 09:46:27
1            2    Animation 2006-02-15 09:46:27
2            3     Children 2006-02-15 09:46:27
3            4     Classics 2006-02-15 09:46:27
4            5       Comedy 2006-02-15 09:46:27
5            6  Documentary 2006-02-15 09:46:27
6            7        Drama 2006-02-15 09:46:27
7            8       Family 2006-02-15 09:46:27
8            9      Foreign 2006-02-15 09:46:27
9           10        Games 2006-02-15 09:46:27

In [51]:
cur.execute("SELECT * FROM staff")
staffdata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'staff' ORDER BY ORDINAL_POSITION")
staffcolumns = list()
for i in cur.fetchall():
    staffcolumns.append(i[0])
staffdf = pd.DataFrame(data=staffdata, columns=staffcolumns)
staffdf
#df from staff table

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update,picture
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793280,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'..."
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-05-16 16:13:11.793280,None

In [52]:
cur.execute("SELECT * FROM store")
storedata = cur.fetchmany(10)
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'store' ORDER BY ORDINAL_POSITION")
storecolumns = list()
for i in cur.fetchall():
    storecolumns.append(i[0])
storedf = pd.DataFrame(data=storedata, columns=storecolumns)
storedf
#df from store table

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 09:57:12
1         2                 2           2 2006-02-15 09:57:12

In [53]:
#1 master
df1 = pd.merge(filmdf, film_actordf, how='left', on='film_id')
df2 = pd.merge(df1, actordf, how='left', on='actor_id')
df3 = pd.merge(df2, inventorydf, how='left', on='film_id')
df4 = pd.merge(df3, rentaldf, how='left', on='inventory_id')
m1 = pd.merge(df4, paymentdf, how='left', on='rental_id')
m1

/tmp/ipykernel_17626/2184309566.py:5: FutureWarning: Passing 'suffixes' which cause duplicate columns {'last_update_x'} in the result is deprecated and will raise a MergeError in a future version.
  df4 = pd.merge(df3, rentaldf, how='left', on='inventory_id')

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,rental_date,customer_id_x,return_date,staff_id_x,last_update_y,payment_id,customer_id_y,staff_id_y,amount,payment_date
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
5,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
6,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
7,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
8,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
9,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
10,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
11,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
12,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
13,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
14,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
15,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
16,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT
17,6,Agent Truman,A Intrepid Panorama of a Robot And a Boy who m...,2006,1,3,2.99,169,17.99,PG,...,NaT,NaN,NaT,NaN,NaT,NaN,NaN,NaN,NaN,NaT

In [54]:
#2 master
df11 = pd.merge(filmdf, film_categorydf, how='left', on='film_id')
df12 = pd.merge(df1, categorydf, how='left', on='category_id')
df13 = pd.merge(df2, inventorydf, how='left', on='film_id')
df14 = pd.merge(df3, rentaldf, how='left', on='inventory_id')
m2 = pd.merge(df4, paymentdf, how='left', on='rental_id')
m2

KeyError: 'category_id'

In [ ]:
#3 & 4 master
df21 = pd.merge(filmdf, inventorydf, how='left', on='film_id')
df22 = pd.merge(df1, rentaldf, how='left', on='category_id')
df23 = pd.merge(df2, paymentdf, how='left', on='film_id')
df24 = pd.merge(df3, staffdf, how='left', on='inventory_id')
m3_4 = pd.merge(df4, storedf, how='left', on='rental_id')
m3_4

KeyError: 'category_id'